app/views/users/show.html.erb

SELECT 1 AS one FROM "microposts" WHERE "microposts"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---

    <% if @user.microposts.any? %>
      <h3>投稿 (<%= @user.microposts.count %>)</h3>