app/views/shared/_user_info.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 101]]
---
<span><%= link_to current_user.name, current_user %></span>
<span><%= "投稿数：#{current_user.microposts.count}" %></span>