app/views/microposts/_micropost.html.erb

        <%# <%= render 'shared/clear_bookmark' %>
        <%= form_with(model: current_user.bookmarks.find_by(micropost_id: micropost.id),
                                                html: { method: :delete }, local: true) do |f| %>
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ? AND "bookmarks"."micropost_id" = ? LIMIT ?  [["user_id", 1], ["micropost_id", 180], ["LIMIT", 1]]

  <ul class= "comments">
    <% micropost.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."micropost_id" = ?  [["micropost_id", 175]]