app/controllers/bookmarks_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ?  [["id", 180], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["micropost_id", 180], ["created_at", "2020-08-22 14:08:22.999800"], ["updated_at", "2020-08-22 14:08:22.999800"]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "micropost_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 6], ["micropost_id", 180], ["action", "bookmark"], ["created_at", "2020-08-22 14:08:23.013467"], ["updated_at", "2020-08-22 14:08:23.013467"]]
---
  def create
    micropost = Micropost.find(params[:micropost_id])
    current_user.bookmark(micropost)
    micropost.create_bookmark_notification!(current_user)

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 1]]
---
  def destroy
    bookmark = Bookmark.find(params[:id])
    bookmark.destroy