app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "arigato"], ["user_id", 762146111], ["micropost_id", 583546149], ["created_at", "2020-08-22 13:59:13.636996"], ["updated_at", "2020-08-22 13:59:13.636996"]]
---
  def create
    @comment = current_user.comments.build(comment_params)
    @comment.micropost_id = params[:micropost_id]
    if @comment.save