app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts" WHERE (user_id IN (SELECT followed_id FROM relationships
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
      flash[:success] = "投稿が完了しました。"
      redirect_to root_url
    else
      @feed_items = current_user.feed.paginate(page: params[:page])