app/controllers/password_resets_controller.rb

  def update
    if params[:user][:password].empty? # 新しいパスワードが空文字だった場合
      @user.errors.add(:password, :blank)
      render 'edit'
    elsif @user.update(user_params) # 正しく更新できた場合
---
UPDATE "users" SET "remember_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["remember_digest", "$2a$04$GMS/BGBnhyNXJNaNL6IdUeWndWi0FBOSRw4ddIT5pLfGTblJaxkX2"], ["updated_at", "2020-08-22 13:59:13.150209"], ["id", 762146111]]