app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:followed_id])
    current_user.follow(@user)
    @user.create_follow_notification!(current_user)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "notifications" ("visitor_id", "visited_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["visitor_id", 762146111], ["visited_id", 950961012], ["action", "follow"], ["created_at", "2020-08-22 13:58:01.076959"], ["updated_at", "2020-08-22 13:58:01.076959"]]

  def destroy
    @user = Relationship.find(params[:id]).followed
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]