app/controllers/static_pages_controller.rb

  def search
    @comment = current_user.comments.build if logged_in?
    if params[:static_page][:search].present?
      microposts = Micropost.search(params[:static_page][:search]).paginate(page: params[:page])
---
SELECT COUNT(*) FROM "microposts" WHERE (content LIKE '%米国%')