app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "user_name", "uid", "oauth_token", "oauth_expires_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "oauth_token" = ?, "oauth_expires_at" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
  def facebook_login
    @user = User.from_omniauth(request.env["omniauth.auth"])
      result = @user.save(context: :facebook_login)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 101], ["LIMIT", 1]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 762146111], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 762146111]]
---
  def show
    @user=User.find(params[:id])
    # @micropost = Micropost.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "user_name") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "email" = ?, "name" = ?, "user_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "foo@bar.com"], ["name", "Foo Bar"], ["user_name", "Foo Bar"], ["updated_at", "2020-08-22 13:56:41.090395"], ["id", 762146111]]
---
  def update
    if @user.update(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
---
  def destroy
    User.find(params[:id]).destroy

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
---
  def following
    @title = "フォロー中"
    @user  = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 762146111], ["LIMIT", 1]]
---
  def followers
    @title = "フォロワー"
    @user  = User.find(params[:id])