app/models/micropost.rb

  def create_bookmark_notification!(visitor)
    #すでに通知が作成されているか確認
    temp = Notification.where(["visitor_id = ? and visited_id = ? and micropost_id = ? and action = ? ",
                                  visitor.id, user_id, id, 'bookmark'])
    if temp.blank?
      notification = visitor.active_notifications.new(
        visited_id: user_id,
        micropost_id: id,
        action: "bookmark"
        )
      if notification.visitor_id == notification.visited_id
         notification.checked = true
      end
      notification.save if notification.valid?
---
SELECT "notifications".* FROM "notifications" WHERE (visitor_id = 1 and visited_id = 6 and micropost_id = 180 and action = 'bookmark' ) ORDER BY "notifications"."created_at" DESC
INSERT INTO "notifications" ("visitor_id", "visited_id", "micropost_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["visitor_id", 1], ["visited_id", 6], ["micropost_id", 180], ["action", "bookmark"], ["created_at", "2020-08-22 14:08:23.013467"], ["updated_at", "2020-08-22 14:08:23.013467"]]