app/models/user.rb

INSERT INTO "bookmarks" ("user_id", "micropost_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 101], ["micropost_id", 176], ["created_at", "2020-08-22 15:01:59.556033"], ["updated_at", "2020-08-22 15:01:59.556033"]]
---
  def bookmark(micropost)
    bookmarked_microposts << micropost

SELECT "notifications".* FROM "notifications" WHERE (visitor_id = 101 and visited_id = 2 and action = 'follow' ) ORDER BY "notifications"."created_at" DESC
INSERT INTO "notifications" ("visitor_id", "visited_id", "action", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["visitor_id", 101], ["visited_id", 2], ["action", "follow"], ["created_at", "2020-08-22 15:01:56.508995"], ["updated_at", "2020-08-22 15:01:56.508995"]]
---
  def create_follow_notification!(visitor)
    #すでに通知が作成されているか確認
    temp = Notification.where(["visitor_id = ? and visited_id = ? and action = ? ",
                              visitor.id, id, 'follow'])
    if temp.blank?
      notification = visitor.active_notifications.new(
        visited_id: id,
        action: 'follow'
      )
      notification.save if notification.valid?

SELECT "users".* FROM "users" WHERE (email = 'miyajima.tasuku.21@gmail.com') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def self.from_omniauth(auth)
    user = User.where('email = ?', auth.info.email).first